Revit.Elements.PerformanceAdviserRule
Performance Adviser Rule

Revit.Elements.PerformanceAdviserRule.Name
The name of the rule.

Revit.Elements.PerformanceAdviserRule.Description
The description of the rule.

Revit.Elements.PerformanceAdviserRule.Enabled
A boolean indicating if the rule is activated.

Revit.Elements.PerformanceAdviserRule.SetEnabled
A boolean indicating if the rule is activated successfully.

Revit.Elements.PerformanceAdviserRule.RuleId
The id of the rule.

Revit.Elements.PerformanceAdviserRule.Execute(System.Collections.Generic.IEnumerable{Revit.Elements.PerformanceAdviserRule})
Execute Rules

Revit.Elements.PerformanceAdviserRule.ById(System.String)
Create Performance Adviser Rule by Id
guid:
Returns:

Revit.Elements.PerformanceAdviserRule.ToString
Outputs rule name and rule description.
Returns: